#coding:gbk

first = {
    "0" : "失眠的夜里",
    "1" : "光棍节",
    "2" : "失恋了",
    "3" : "无聊的周未",
    "4" : "大病初愈",
    "5" : "雷电交加的夜晚",
    "6" : "喝醉了酒",
    "7" : "情人节晚上",
    "8" : "等爱人出差了",
    "9" : "吃饱以后"
}

second =  {
    "0" : "在浴池",
    "1" : "在下水道里",
    "2" : "在小溪边",
    "3" : "在马背上",
    "4" : "在地毯上",
    "5" : "在酒吧",
    "6" : "在高中教室",
    "7" : "在电影院",
    "8" : "在公交车上",
    "9" : "在厕所"
}

third = {
    "0" : "跟梦中情人",
    "1" : "跟心中偶像",
    "2" : "跟隔壁吴老二",
    "3" : "跟猥琐怪叔叔",
    "4" : "跟大胖子",
    "5" : "跟保洁阿姨",
    "6" : "跟老奶奶",
    "7" : "跟数学老师",
    "8" : "跟初恋情人",
    "9" : "跟无家可归的小女孩"
}

fourth =  {
    "0" : "唱《爱上一个不回家的人》",
    "1" : "比赛吃蟑螂",
    "2" : "紧紧的拥抱在一起",
    "3" : "背靠背坐在一起",
    "4" : "静静的看着彼此",
    "5" : "接吻",
    "6" : "憧憬你们美好的未来",
    "7" : "一起光着身子跑来跑去",
    "8" : "玩真心大冒险",
    "9" : "拉粑粑"
}

print "让我们来玩个游戏！"
telphone_number = raw_input("请输入你的手机号码后四位:> ")

myNum = list(telphone_number)
print "%s，%s%s%s" % (first[myNum[0]], second[myNum[1]], third[myNum[2]], fourth[myNum[3]])